
//# plugins.serverLive
//***********************************************
//Подключение Live Server 
export const server = (done) => {
  //# *******************************************
  app.plugins.serverLive.init({
    //--------------------
    server: {
      baseDir: `${app.path.build.html}`,  //>Наблюдаем за файлом (index.html)
      watch: true // Значение по умолчанию
    },
    //--------------------
    notify: false, // Отключаем сообщение в браузере.
    port: 3000, // Настройка порта
    open: false,
    //--------------------
  })
  //# *******************************************
}
//***********************************************
